# money = 780
# 500 - 1
# print("500원 갯수 : ",money//500)
# 100 - 2
# print("100원 갯수 : ",(money%500)//100)
# 50 - 1
# print("50원 갯수 : ", ((money%500)%100)//50)
# 10 - 3
# print("10원 갯수 : ", (((money%500)%100)%50)//10)

# money = 1759870
# 50000, 10000, 5000, 1000, 500, 100, 50, 10
# print("5만원 권 갯수 : ",money%50000)
# print("1만원 권 갯수 : ",(money%50000)//10000)
# print("5천원 권 갯수 : ",(money%50000)//5000)
# print("천원 권 갯수 : ",((money%50000)%5000)//1000)
# print("5백원 갯수 : ",(((money%50000)%5000)%1000)//500)
# print("백원 갯수 : ",((((money%50000)%5000)%1000)%500)//100)
# print("50원 갯수 : ",(((((money%50000)%5000)%1000)%500)%100)//50)
# print("10원 갯수 : ",((((((money%50000)%5000)%1000)%500)%100)%50)//10)

# str1 = input("문자를 입력하세요.")
# a = len(str1) # 문자의 길이 .length
# if a == 5:
#   print("a는 5입니다.")
# elif a == 4: # else if
#   print("a는 4입니다.")
# elif a == 3:
#   print("a는 3입니다.")
# else:
#   print("a는 2 이하입니다.")

#1759870 9870 590
